Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: ཀྱེ་ལིད་ཚ་བཱི་གཞོན་ནུ་བདག་ནི་བཅོམ་ལྡན་འདས་ཀྱི་རིང་བསྲེལ་མཆོད་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་ཞིག་གསོལ་གྱིས་དེ་ཁྱོད་ཀྱིས་བྱིན་ཅིག །རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་དེ་མངོན་པར་མཆོད་ན་སུམ་ཅུ་རྩ་གསུམ་པའི་བདག་པོར་འགྱུར་རོ་ཞེས་གྲགས་པས་ན་རིང་བསྲེལ་གྱི་ཕྱེ་མ་དཀར་རུ་ནི་ཤིན་ཏུ་གཅེས་སོ།
en: “O Licchavi youth! Please grant my request for a single mustard seed–sized relic from the Bhagavān, so that I can make offerings to the Bhagavān’s relics. I have heard that one who makes offerings to just one mustard seed–sized relic will become lord of the Heaven of the Thirty-Three. Therefore, I would greatly treasure just a single white speck of a relic.

source: །ཀྱེ་ལིད་ཚ་བཱི་གཞོན་ནུ་སྤྲིན་ཆེན་པོའི་མདོ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཤེས་པར་དཀའ་བ། ཁོང་དུ་ཆུད་པར་དཀའ་བ།
en: O Licchavi youth! This Great Cloud discourse is difficult for even śrāvakas and pratyekabuddhas to understand and penetrate.

source: མཚན་ཉིད་དེ་ལྟ་བུ་དང་ལྡན་པ་ཡང་སྤྲིན་ཆེན་པོའི་མདོ་ལས་ཕྱི་རོལ་དུ་གྱུར་ཅེས་གྲགས་པ་ཉོན་ཅིག །ཀྱེ་ལིད་ཚ་བཱི་གཞོན་ནུ་སྤྲིན་ཆེན་པོའི་མདོ་ནི་དེ་ལྟར་ཤེས་པར་དཀའ་ཞིང་རྟོགས་པར་དཀའ་བས་ན།
en: How much more is this the case for one such as myself, who is known as an outsider to this Great Cloud discourse. Hear me now, O Licchavi youth! This Great Cloud discourse is so hard to understand, so hard to realize.

source: ཁོ་བོ་ཅག་མཐའ་འཁོབ་ཀྱི་གླིང་གི་བྲམ་ཟེ་རྣམས་ནི་གང་བཅངས་ན་སེམས་ཅན་རྣམས་མྱུར་དུ་སུམ་ཅུ་རྩ་གསུམ་པའི་བདག་པོ་ཐོབ་པར་འགྱུར་བའི་རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་ཟ་མ་ཏོག་གི་ནང་དུ་བཅུག་ལ་བཅངས་ཀྱང་རུང་ངོ་།
en: How could we brahmins from the borderlands uphold it? It would be more suitable for us to bear within a precious casket a mustard seed–sized relic, through which sentient beings can quickly attain lordship over the Heaven of the Thirty-Three.

source: །ཀྱེ་ལིད་ཚ་བཱི་གཞོན་ནུ་ཁྱོད་ཇི་དེ་བཞིན་གཤེགས་པ་ལས་རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་གསོལ་ཏེ་མནོས་ལ་ཟ་མ་ཏོག་གི་ནང་དུ་བཅུག་སྟེ། བཅངས་པས་སུམ་ཅུ་རྩ་གསུམ་པའི་བདག་པོར་འགྱུར་བ་མི་འདོད་དམ།
en: O Licchavi youth! How could you be unwilling to grant my request for a mustard seed–sized relic from the Tathāgata, so that I may place it within a precious casket and bear it and thereby become lord of the Heaven of the Thirty-Three?

source: ཀྱེ་ལིད་ཚ་བཱི་གཞོན་ནུ་ཁོ་བོས་ནི་དམ་པ་འདི་ལྟ་བུ་གསོལ་ཏོ།
en: May you please grant such a boon!”

source: །ལིད་ཚ་བཱི་གཞོན་ནུ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མཐོང་ན་དགའ་བས་སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་ལ་ཚིགས་སུ་བཅད་པ་དག་གིས་སླར་སྨྲས་པ། གང་ཚེ་གང་གར་ཀུ་མུད་སྐྱེས། །བྱི་བ་གླང་ཆེན་ཙམ་གྱུར་དང་། །ཁུ་བྱུག་དུང་མདོག་འདྲར་གྱུར་དང་། །འཛམ་བུ་ཏ་ལའི་འབྲུ་ཆགས་པ།
en: The Licchavi youth Admired by All Worlds then replied to the brahmin Kauṇḍinya, the master grammarian, uttering these verses: “When the kumuda flower blooms in the Ganges River, When a mouse becomes the size of an elephant, When the cuckoo becomes the color of a conch shell, When the rose-apple tree grows from the palm tree’s seed, At that time a relic may be obtained. “

source: །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །ནམ་ཞིག་རུ་སྦལ་སྤུ་རྣམས་ལས། །གོས་སུ་ལེགས་པར་བཏགས་གྱུར་ཏེ། །དགུན་ཆ་དག་ཏུ་གྱོན་གྱུར་པ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་གྱུར།
en: When from the hairs of the tortoise One can weave fine clothing That can be worn for many winters, At that time a relic may be obtained. “

source: །དེར་ནི་གྲོང་ཁྱེར་སྦས་པའི་ཕྱིར། །ནམ་ཞིག་སྦྲང་བུའི་རྐང་ལག་ལས། །ཡང་ཐོག་ལེགས་པར་བྱས་གྱུར་ཏེ། །བརྟན་ཞིང་གཡོ་བ་མེད་པ་དང་།
en: When, to shelter a city, One could construct a dome from the limbs of bees That is stable and unwavering, At that time a relic may be obtained. “

source: །སྲིན་བུ་པད་མའི་རྭ་སོགས་ལ། །ཁྱོད་ནི་དབང་བསྐུར་སྦྱོར་བྱེད་དེ། །དེར་ནི་འབྱོར་ཅིང་རྒྱས་གྱུར་ན། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར།
en: When by applying a magical enchantment To the teeth of a leech and the like They thereby grow and expand, At that time a relic may be obtained. “

source: །མཐོ་རིས་སུ་ནི་འཛེག་པའི་ཕྱིར། །ནམ་ཞིག་རི་བོང་རྭ་རྣམས་ལ། །སྐས་ནི་ལེགས་པར་བྱས་གྱུར་པ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར།
en: When out of hares’ horns A staircase can be constructed For ascending to the higher realms, At that time a relic may be obtained. “

source: །ནམ་ཞིག་སྐས་ནི་དེར་འཛེགས་ཏེ། །བྱི་བས་ཟླ་བ་བཟའ་བ་དང་། །སྒྲ་གཅན་ལ་ཡང་གནོད་བྱེད་པ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: When a mouse can ascend that staircase And proceed to eat the moon And thus destroy Rāhu, At that time a relic may be obtained. “

source: ཚོགས་ཀྱིས་རྒྱུ་བའི་སྦྲང་བུ་ཡིས། །ནམ་ཞིག་རྫ་མའི་ཆང་འཐུངས་ཏེ། །ཁྱིམ་ན་གནས་པར་བྱེད་གྱུར་པ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར།
en: When a swarm of flies Can drink a pot of alcohol And then go live inside a house, At that time a relic may be obtained. “

source: །ནམ་ཞིག་བོང་བུ་བདེར་གྱུར་ལ། །མཆུ་དམར་བིམ་པ་འདྲ་འགྱུར་ཅིང་། །གླུ་གར་རྣམས་ལ་མཁས་གྱུར་པ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: When a donkey, growing elated, Gets lips as red as an apple And becomes skilled in song and dance, At that time a relic may be obtained. “

source: ནམ་ཞིག་ཁྭ་དང་འུག་པ་དང་། །དབེན་པར་དོང་ནས་སྨྲ་བྱེད་ཅིང་། །ཕན་ཚུན་གནོད་པ་མི་བྱེད་པར། །དུས་རྣམས་ཀུན་ཏུ་གནས་དེར་ནི། །རྟག་ཏུ་གནས་པར་བྱེད་གྱུར་པ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར།
en: When crows and owls Leave their isolated places and talk together And, agreeing to no longer harm one another, Always live together in all places and seasons, At that time a relic may be obtained. “

source: །པ་ལ་ཤ་ཡི་ལོ་མ་རྣམས། །རིན་ཆེན་སྣ་གསུམ་གདུགས་གྱུར་ཏེ། །ཆར་འབབ་སྐྱབས་སུ་ནམ་འགྱུར་བ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར།
en: When the leaves of the palāśa tree Transform into parasols adorned with three kinds of jewels And, drifting downward, provide coverage throughout space, At that time a relic may be obtained. “

source: །ནམ་ཞིག་རྒྱ་མཚོའི་གྲུ་བོ་ཆེ། །འཁྲུལ་འཁོར་དང་ནི་གཡོར་མོར་བཅས། །མི་ངན་ངོས་ནི་ཁྱེར་འགྲོ་བ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར།
en: When a great oceanic vessel Equipped with a mechanical wheel and sails Can drive up onto and travel upon dry land, At that time a relic may be obtained. “

source: །ནམ་ཞིག་བྱ་ནི་ཀུ་ལང་ཀས། །རི་བོ་སྤོས་ཀྱི་ངད་ལྡང་བ། །མཆུ་ལ་ཐོགས་ཏེ་འགྲོ་འགྱུར་བ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: When a sparrow Can pick up the Fragrant Mountain And hold it in its beak while flying, At that time a relic may be obtained.”

source: སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱས་ལིད་ཚ་བཱི་གཞོན་ནུ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མཐོང་ན་དགའ་བ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་སླར་སྨྲས་པ། གཞོན་ནུ་ཆེན་པོ་ལེགས་སོ་ལེགས།
en: The brahmin Kauṇḍinya, the master grammarian, then replied to the Licchavi youth Admired by All Worlds with these verses: “Excellent, great youth, excellent!

source: །དེ་བཞིན་གཤེགས་སྲས་དཔའ་བོ་ཆེ། །དཔའ་ཞིང་ཐབས་ལ་མཁས་ལྡན་པ།
en: The children of the Tathāgata are great heroes Possessing courage and skillful means.

source: །ཆེ་བ་ཉིད་ལྡན་ལུང་བསྟན་ཐོབ། །
en: With such greatness, they obtain prophecies of future buddhahood. “

source: དེ་བཞིན་གཤེགས་པའི་ཆེ་བ་ཉིད། །གཞོན་ནུ་ཆེན་པོས་རིམ་བཞིན་ཉོན།
en: Great youth, listen as I explain in turn About the great qualities of the Tathāgata.

source: །སངས་རྒྱས་ཡུལ་ནི་བསམ་མི་ཁྱབ།
en: The domain of the Buddha is inconceivable.

source: །བསམ་ཡས་ཡེ་ཤེས་མི་མཉམ་མཉམ།
en: His gnosis is beyond conception, equal to the unequaled. “

source: །དེ་བཞིན་གཤེགས་རྣམས་མཚུངས་པ་མེད།
en: The tathāgatas are unparalleled.

source: །སངས་རྒྱས་ཐམས་ཅད་རྟག་ཏུ་ཞི།
en: All buddhas are permanently tranquil.

source: །སངས་རྒྱས་ཐམས་ཅད་ཡང་དག་བྱུང་།
en: All buddhas are truly arisen.

source: །སངས་རྒྱས་ཐམས་ཅད་ཁ་དོག་མཚུངས།
en: All buddhas have the same appearance. “

source: །འདི་ནི་སངས་རྒྱས་ཆོས་ཉིད་ཡིན།
en: This is the actual nature of the buddhas.

source: །སངས་རྒྱས་བཅོམ་ལྡན་བཅོས་མ་མིན།
en: The bhagavān Buddha is not a fabrication.

source: །དེ་བཞིན་གཤེགས་རྣམས་མ་སྐྱེས་ཏེ།
en: All the tathāgatas are unborn.

source: །རྡོ་རྗེ་ལྟ་བུར་མཁྲེགས་པའི་སྐུ། །སྤྲུལ་པའི་སྐུ་ཡང་སྟོན་པར་མཛད།
en: Their bodies, unbreakable like vajras, Further display as emanation bodies. “

source: །ཡུངས་འབྲུ་ཙམ་གྱི་རིང་བསྲེལ་ཡང་། །འབྱུང་བར་འགྱུར་བ་ཡོང་མེད་དེ།
en: No relic, even one the size of a mustard seed, Ever arises or comes into existence.

source: །རུས་པ་ཁྲག་དང་ཤ་མེད་ལ། །རིང་བསྲེལ་ཡོད་པར་ག་ལ་འགྱུར།
en: Since they are not made of bone, blood, or flesh, How could there ever be relics?

source: །སེམས་ཅན་རྣམས་ལ་ཕན་པའི་ཕྱིར། །ཐབས་ཀྱིས་རིང་བསྲེལ་བཞག་པ་མཛད།
en: Yet for the benefit of sentient beings, They establish relics out of skillful means. “

source: །བཅོམ་ལྡན་སངས་རྒྱས་ཆོས་ཀྱི་སྐུ།
en: The bhagavān Buddha is the Dharma body.

source: །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབྱིངས།
en: The Tathāgata is the Dharma realm.

source: །བཅོམ་ལྡན་སྐུ་ནི་དེ་འདྲ་ལ། །ཆོས་བསྟན་པ་ཡང་དེ་འདྲ་སྟེ།
en: Since the Bhagavān’s body is like this, His Dharma teachings are also like this. “

source: །དེ་ལྟར་བདག་གིས་ཐོས་རིག་ནས། །ཆོས་གསུང་པ་ནི་དམ་པ་གསོལ། །
en: Having heard and come to know this, I request the exposition of the sacred Dharma.

source: ཁྱོད་ནི་སྨྲ་བར་གཞུག་པའི་ཕྱིར། །གཏམ་གྱི་གླེང་ནི་བདག་གིས་བསླང་།
en: I beseech you to discuss it with me So that I may comprehend your explanations.”

source: །དེ་ནས་དེའི་ཚེ་ལྷ་མོ་དྲི་མ་མེད་པའི་འོད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱས་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: At that time, a goddess named Stainless Light paid homage to the Bhagavān and uttered this verse: “O Bhagavān!

source: །བཅོམ་ལྡན་འདས་ཀྱེ་མ་ཐབས་ཀྱི་སྐྱེས་བུ་འདི་གཉིས་ནི་མཁས་ཤིང་ཞི་བ་ལ་ཤེས་པ་ཟབ་མོ་དང་ལྡན་ཏེ། དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ཤིན་ཏུ་གསལ་བར་འཚལ་བ་ལགས་ན།
en: These two great beings of skillful means, Who possess both learning and profound knowledge of tranquility, Have sought to elucidate the greatness of the Tathāgata’s qualities.

source: བཅོམ་ལྡན་འདས་སྐྱེས་བུ་དམ་པ་འདི་གཉིས་སུ་ལགས་པ་དང་། གང་ནས་མཆིས་པ་སེམས་ཅན་ཐམས་ཅད་ལ་སྨན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Bhagavān, where have these two sacred beings come from? I beseech the Bhagavān to explain this, to serve as medicine for all sentient beings.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷ་མོ་ལེགས་སོ་ལེགས་སོ།
en: The Bhagavān replied, “Excellent, goddess, excellent!

source: །ལྷ་མོ་ཁྱོད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་ཞུས་པ་ལེགས་སོ།
en: It is excellent that you have asked this of the Tathāgata in order to benefit all sentient beings.

source: །ལྷ་མོ་ཉོན་ཅིག །
en: Listen, goddess!

source: གཙོ་བོ་ཆེན་པོ་འདི་གཉིས་ནི་དེ་བཞིན་གཤེགས་པའི་སྲས་ཡིན་ཏེ།
en: These two great lords are the children of the Tathāgata.

source: ལྷ་མོ་གཙོ་བོ་ཆེན་པོ་འདི་གཉིས་ནི་སྐྱེས་བུ་དམ་པ་རྣམས་ཀྱི་བདག་པོ་འཁོར་བ་ལ་དགའ་བའི་སྨོན་ལམ་བཏབ་པའི་སྐྱེས་བུ་ངལ་བྱས་པ་གཟོ་བ།
en: Goddess, these two great lords are the chiefs of all sacred beings. They are beings who have made the aspiration to delight in cyclic existence. They are grateful for the deeds I have performed.

source: ངའི་བུ་སྡུག་པ་ཤཱཀྱའི་རུས་དང་རིགས་འཛིན་པ།
en: They love my children. They uphold the lineage and family of the Śākyas.

source: ངའི་བསྟན་པའི་ཁུར་ཁྱེར་བ།
en: They shoulder the burden of my teachings.

source: ངའི་བསྟན་པའི་སྒྲོན་མ་རབ་ཏུ་འབར་བར་བྱེད་པ་ཡིན་གྱིས་རྗེས་སུ་ཡི་རང་བར་གྱིས་ཤིག །
en: They cause the lamp of my teachings to blaze forth. Therefore, you should rejoice in them!

source: ལྷ་མོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་བས་ཀྱང་ཆེས་གྲངས་མེད་པ། བསྐལ་པ་མང་བས་ཀྱང་ཆེས་མང་བ་འདས་པ་དེའི་ཚེ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀླུ་རིགས་སྒྲོན་མ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་།
en: Goddess, in a past age, countless eons ago, many great eons past—at that time, there had arisen in the world a tathāgata, one endowed with knowledge and its supporting conduct, one gone to bliss, a knower of the world, an unexcelled charioteer who tames beings, a teacher of humans and gods, a bhagavān buddha named Lamp of the Nāga Family. “

source: །ལྷ་མོ་དེའི་ཚེ་འཛམ་བུའི་གླིང་འདི་འབྱོར་པ་དང་། རྒྱས་པ་དང་། ལོ་ལེགས་པ་དང་། ཉམས་དགའ་བར་གྱུར་ཏེ།
en: At that time, goddess, this land of Jambudvīpa was abundant and flourishing; harvests were good, and everything was agreeable.

source: སྐྱེ་བོ་དང་མི་མང་པོས་གང་ཞིང་བདེ་བ་དང་། ཡིད་བདེ་བ་དང་ལྡན་པར་གྱུར་ཏོ།
en: All humans and other beings were satiated and comfortable, and their minds were at ease.

source: །དེའི་ཚེ་འཛམ་བུའི་གླིང་འདི་ཡངས་ཤིང་རྒྱ་ཆེ་ལ་ཆུ་ཞེང་དང་ཐ་གྲུ་ཆེ་བར་གྱུར་ཏེ། ངོས་གཅིག་ལ་དཔག་ཚད་འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ཡོད་པར་གྱུར་ཏོ།
en: At that time, the area of the spacious and vast expanse of Jambudvīpa was one hundred sixty-eight thousand yojanas wide on each side.

source: །དེའི་ཚེ་འཛམ་བུའི་གླིང་འདི་ན་གྲོང་ཁྱེར་དཔག་ཚད་བཅུ་གཉིས་པ། མི་བྱེ་བ་ཕྲག་དགུ་བཅུ་དགུ་བཅུ་གནས་པ་བདུན་ཁྲི་བརྒྱད་སྟོང་ཡོད་དེ།
en: At that time, here in Jambudvīpa, there were eighteen thousand cities twelve yojanas wide, each with nine hundred ninety million inhabitants.

source: གྲོང་ཁྱེར་དེ་དག་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པ་ཤ་སྟག་གོ།
en: All those cities, moreover, were constructed from nothing but the seven precious substances.

source: །ལྷ་མོ་དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་འདིར་གྲོང་ཁྱེར་རིན་ཆེན་འབྱུང་གནས་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ། གྲོང་ཁྱེར་ཆེན་པོ་གང་དུ་དེ་བཞིན་གཤེགས་པ་དེ་བྱུང་བ་དེར་མི་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་གནས་པར་གྱུར་ཏོ།
en: Goddess, at that time this city of Rājagṛha was called Source of Jewels, and in that great city, where the Tathāgata had arisen, there lived eighty trillion people.

source: །གྲོང་ཁྱེར་ཆེན་པོ་རིན་ཆེན་འབྱུང་གནས་ཀྱི་ནང་ན་སེམས་ཅན་གནས་པ་ཐམས་ཅད་ཀྱང་ཐེག་པ་ཆེན་པོ་ལ་མངོན་པར་རྩེ་བའི་བྱང་ཆུབ་སེམས་དཔའ་མི་མཆོག་ཤ་སྟག་གོ།
en: All the sentient beings who lived in that great city Source of Jewels were nothing but supreme bodhisattvas who played within the Great Vehicle. “

source: །ལྷ་མོ་དེའི་ཚེ་གྲོང་ཁྱེར་རིན་ཆེན་འབྱུང་གནས་ཀྱི་ནང་ན་དེ་བཞིན་གཤེགས་པ་ཀླུ་རིགས་སྒྲོན་མ་བྱང་ཆུབ་སེམས་དཔའ་མི་མཆོག་རྣམས་ཀྱི་ནང་ན་སྤྲིན་ཆེན་པོའི་མདོ་འདི་སེང་གེའི་སྒྲ་ཆེན་པོས་མངོན་པར་སྟོན་པར་མཛད་དོ།
en: At that time, goddess, within the city Source of Jewels, the tathāgata Lamp of the Nāga Family manifested the lion’s roar of the teaching of this Great Cloud discourse amid all those supreme bodhisattvas.

source: །ལྷ་མོ་དེའི་ཚེ་གྲོང་ཁྱེར་རིན་ཆེན་འབྱུང་གནས་སུ་ཆོས་ཀྱི་རྒྱལ་པོ་བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་།
en: At that time. goddess, within the city Source of Jewels there was a Dharma king named Great Diligent Nāga.

source: །ལྷ་མོ་ཆོས་ཀྱི་རྒྱལ་པོ་བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུ་དེའི་བཙུན་མོ་དམ་པ་ལྷ་མོ་ཐེག་པ་ཆེན་པོ་ལ་རབ་ཏུ་དགའ་བར་སེམས་པ་བསྟན་པ་འཛིན་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་།
en: Goddess, that Dharma king Great Diligent Nāga had a queen named Sacred Goddess Who Upholds the Teachings and Delights in the Great Vehicle.

source: །ཆོས་ཀྱི་རྒྱལ་པོ་དེའི་བློན་པོ་ཆེན་པོ་དམ་པའི་ཆོས་ཀྱི་དཀྱིལ་འཁོར་གྱི་མཛོད་ཅེས་བྱ་བ་ཞིག་ཀྱང་བྱུང་ངོ་།
en: That Dharma king also had a great minister named Storehouse of the Domain of the Sacred Dharma. “

source: །ལྷ་མོ་དེའི་ཚེ་རྒྱལ་པོ་བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུ་དེ་ལ་བློན་པོ་ཆེན་པོས་ཡོངས་སུ་བསྐོར་ཏེ།
en: At that time, goddess, the great minister circumambulated King Great Diligent Nāga.

source: བཙུན་མོ་དམ་པ་དེས་མདུན་དུ་བདར་ཅིང་བསྐོར་ནས་དེ་བཞིན་གཤེགས་པ་ཀླུ་རིགས་སྒྲོན་མ་དེ་ལ་མཆོད་པ་ཆེན་པོ་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་ཀླུ་རིགས་སྒྲོན་མ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Then, Queen Sacred went before him and circumambulated him and then made great offerings to the tathāgata Lamp of the Nāga Family. They then joined their palms, bowed in homage before the Tathāgata, and sat down to one side.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཀླུ་རིགས་སྒྲོན་མ་དེས་རྒྱལ་པོ་བརྩོན་འགྲུས་ཆེན་པོ་ཀླུའི་ལྷག་པའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་མི་འཇིགས་འཇིགས་མེད་རྣམ་པ་ཞེས་བྱ་བའི་འོད་ཟེར་བཏང་ནས་འོད་ཟེར་བཏང་བ་དེས་དེ་བཞིན་གཤེགས་པའི་མཐུས་བློན་པོ་ཆེན་པོ་དམ་པའི་ཆོས་ཀྱི་དཀྱིལ་འཁོར་གྱི་མཛོད་ཀྱི་དེ་བཞིན་གཤེགས་པའི་རིང་བསྲེལ་གྱི་གཏམ་གྱི་གླེང་བསླང་སྟེ།
en: The bhagavān tathāgata Lamp of the Nāga Family, knowing that King Great Diligent Nāga had given rise to the superior intention, then emitted a ray of light called unfearing fearlessness. Having emitted that ray of light, the Tathāgata, through his power, caused the great minister Storehouse of the Domain of the Sacred Dharma to begin a discussion of the Tathāgata’s relics and inquire about them.

source: ཞུ་བ་ཞུས་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་དེ་ཅང་མི་གསུང་བར་གྱུར་ཏོ།
en: At that time, the Bhagavān remained silent in response to the minister’s inquiry. “

source: །དེའི་ཚེ་རྒྱལ་པོ་བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུས་རང་གི་བློན་པོ་ཆེན་པོ་དམ་པའི་ཆོས་ཀྱི་དཀྱིལ་འཁོར་གྱི་མཛོད་ལ་ཕྱིར་དྲི་བར་བསམས་སོ།
en: At that time, King Great Diligent Nāga decided to again ask his great minister Storehouse of the Domain of the Sacred Dharma.

source: །དེ་ལྟར་སྐྱེས་བུ་དེ་གཉིས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་བྱ་བའི་ཕྱིར་རིང་བསྲེལ་གྱི་གཏམ་གྱི་ཐབས་འདི་གཅིག་པུ་འདྲི་བ་ལ་མངོན་པར་རྩེ་བར་གྱུར་ཏོ།
en: In this fashion those two beings, to benefit all sentient beings, discussed the Tathāgata’s relics and together inquired about them.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཀླུ་རིགས་སྒྲོན་མའི་ཉན་ཐོས་མིང་ཆེན་ཞེས་བྱ་བས་རིང་བསྲེལ་གྱི་གཏམ་གྱི་ཐབས་འདི་ཐོས་ནས་འདི་སྙམ་དུ་སེམས་བསྐྱེད་དེ།
en: The tathāgata Lamp of the Nāga Family had a disciple named Great Name, who, on hearing this discussion of relics, thought,

source: ཀྱེ་མ་བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུ་ནི་ཆོས་ཅན་ཆོས་ཀྱི་རྒྱལ་པོ་མཁས་པ་ཡིན་ཏེ། དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ཤིན་ཏུ་གསལ་བར་རབ་ཏུ་ཤེས་སོ་
en: ‘Oh! Great Diligent Nāga is a skilled Dharma king who possesses the Dharma and clearly understands the greatness of the Tathāgata’s virtuous qualities.’ Upon thinking thus, he asked the Tathāgata about the greatness of Great Diligent Nāga.

source: སྙམ་ནས་བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུའི་ཆེ་བ་ཉིད་དེ་བཞིན་གཤེགས་པ་ལ་ཞུས་སོ། །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཀླུ་རིགས་སྒྲོན་མས་འཁོར་ཐམས་ཅད་ལ་ཕན་པའི་ཕྱིར་སྤྲིན་ཆེན་པོའི་མདོའི་ཡུལ་དང་། བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུའི་ཆེ་བ་ཉིད་རྒྱས་པར་བསྟན་ཏོ།
en: Then, the tathāgata Lamp of the Nāga Family, for the benefit of his entire retinue, gave extensive teachings on the domain of The Great Cloud and on the greatness of Great Diligent Nāga.

source: །དེ་ནས་འཁོར་ཆེན་པོས་བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུའི་ཆེ་བ་ཉིད་བསྟན་པ་བཤད་པ་འདི་ཐོས་ནས་ངོ་མཚར་རྨད་དུ་བྱུང་བར་འཛིན་པར་གྱུར་ཏོ།
en: When they heard this teaching explaining the greatness of Great Diligent Nāga, all within the great retinue took it to be wondrous and amazing. “

source: །ལྷ་མོ་དེའི་ཚེ་རྒྱལ་པོ་བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུས་བདག་ཉིད་ཀྱི་ཡོན་ཏན་བཤད་པ་ཐོས་ནས་བློན་པོ་ཆེན་པོ་དང་། བཙུན་མོའི་འཁོར་དང་བཅས་པས་དེ་བཞིན་གཤེགས་པ་དེའི་ཞབས་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: At that time, goddess, when King Great Diligent Nāga heard his own virtuous qualities explained, he and his great minister, queen, and retinue prostrated together before the Tathāgata, touching their heads to the Tathāgata’s feet hundreds of thousands of times.

source: དེ་བཞིན་གཤེགས་པ་ཀླུ་རིགས་སྒྲོན་མ་ལ་རིན་པོ་ཆེ་སྤར་གང་གིས་གཏོར་ནས་འདི་སྙམ་དུ་སེམས་བསྐྱེད་དེ། བཅོམ་ལྡན་འདས་མ་འོངས་པའི་དུས་ན་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་བསྟན་པའི་ཐབས་ནུབ་པའི་ཚེ་བདག་རབ་ཏུ་བྱུང་སྟེ།
en: Scattering handfuls of jewels over the tathāgata Lamp of the Nāga Family, he gave rise to this thought: ‘Bhagavān, in the future when the skillful methods of the teachings of the Bhagavān Śākyamuni are waning, I will go forth to renunciation.

source: ཆོས་ཀྱི་མཇུག་ལ་བབ་པ་ན་སྒྲ་ཆེན་པོ་ལན་གསུམ་བསྒྲགས་ལ་ཆོས་གོས་ཙམ་འཆང་བ་མུ་སྟེགས་མགོ་བྱི་བ་རྣམས་ཡུལ་ནས་བསྐྲད་ལ་དམ་པའི་ཆོས་བྱུང་སྟེ།
en: When the end of the Dharma arrives, may I sound the great roar three times, dispelling all those who merely wear the robes of Dharma practitioners and those non-Buddhists with shaved heads, so that the sacred Dharma may arise.

source: དམ་པའི་ཆོས་ཀྱི་ཕྱིར་བདག་གི་སྲོག་འདོར་བར་གྱུར་ཅིག་ཅེས་བྱས་སོ།
en: May I give up my life for the sake of the sacred Dharma.’ “

source: །དེའི་ཚེ་བློན་པོ་ཆེན་པོ་དམ་པའི་ཆོས་ཀྱི་དཀྱིལ་འཁོར་གྱི་མཛོད་ཀྱིས་འདི་སྙམ་དུ་སེམས་བསྐྱེད་དེ།
en: Then, the great minister Storehouse of the Domain of the Sacred Dharma gave rise to this thought: ‘Bhagavān, in the future I will carry the burden of the teachings of the Bhagavān Śākyamuni.

source: བཅོམ་ལྡན་འདས་མ་འོངས་པའི་དུས་ན་བདག་གིས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་བསྟན་པའི་ཁུར་བཀུར་ཞིང་བཅོམ་ལྡན་འདས་ཐབས་ཀྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ན་མིའི་བདག་པོ་ཁྱད་པར་དུ་འཕགས་པ་ཕུན་སུམ་ཚོགས་པའི་རྒྱལ་སྲིད་ཡོངས་སུ་སྤྱད་དེ། དམ་པའི་ཆོས་ཀྱི་སྒྲ་ཆེན་པོ་མངོན་པར་སྒྲོགས་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ།
en: When the Bhagavān has employed the skillful means of passing into parinirvāṇa, may I be a lord of humans who establishes an abundant and excellent kingdom and actually sounds the great roar of the sacred Dharma.’

source: །དེ་ནས་དེའི་ཚེ་རྒྱལ་པོ་བརྩོན་འགྲུས་ཆེན་པོའི་ཀླུའི་བཙུན་མོ་དམ་པ་ལྷ་མོས་འདི་སྙམ་དུ་སེམས་བསྐྱེད་དེ། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་བསྟན་པ་གནས་པའི་ཚེ་བདག་གིས་མུ་སྟེགས་ཅན་ངན་པའི་ཚོགས་ཐམས་ཅད་བུད་མེད་ཀྱི་གཟུགས་ཀྱིས་བཏུལ་ནས་རྒྱལ་པོའི་ཆོས་ལུགས་སྤྱད་དེ་རྒྱལ་སྲིད་མངོན་པར་སྤྱད་ལ་ཆོས་ཀྱི་སྒྲ་ཆེན་པོ་མངོན་པར་སྒྲོགས་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ།
en: At that time, King Great Diligent Nāga’s queen Sacred Goddess gave rise to this thought: ‘When the Bhagavān Śākyamuni’s teachings have been established, I will discipline all the negative hosts of non-Buddhists in my female form. Then, may I establish the royal order, adorn the kingdom, and sound the great roar of the sacred Dharma.’ “

source: །དེ་ནས་དེའི་ཚེ་མིང་ཆེན་གྱིས་འདི་སྙམ་དུ་སེམས་བསྐྱེད་དེ། བཅོམ་ལྡན་འདས་མ་འོངས་པའི་དུས་ན་བདག་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་བསྟན་པ་ལ་ཉན་ཐོས་ཀྱི་མཆོག་ཏུ་གྱུར་ཏེ།
en: At that time Great Name gave rise to this thought: ‘Bhagavān, in the future I will become one of the supreme disciples of the Bhagavān Śākyamuni’s teachings.

source: དེ་བཞིན་གཤེགས་པའི་མཐུས་དེ་བཞིན་གཤེགས་པའི་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡུལ་ལ་རྣམ་པར་འཕྲུལ་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་མཆོག་གིས་འབྲས་བུ་ཡོད་པར་ཆོས་སྟོན་པའི་ཆོ་ག་དེ་ལྟ་བུའི་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡུལ་གཙོ་བོར་གྱུར་པའི་ཡོན་ཏན་དང་ལྡན་པར་གྱུར་ནས་བདག་གིས་སེང་གེའི་སྒྲ་མངོན་པར་བསྒྲགས་ལ། དེ་བཞིན་གཤེགས་པའི་བསྟན་པའི་ཁུར་ལྕི་བ་ཡུན་རིང་པོར་ཁྱེར་བར་གྱུར་ཅིག་ཅེས་བྱས་སོ།
en: May I come to possess, through the Tathāgata’s power, the virtuous qualities of lordship over the inconceivable domain of the Dharma doctrine on the existence of fruition, which is taught through the great lion’s roar that magically manifests the inconceivable domain of the Tathāgata. May I sound the lion’s roar and long bear the burden of the Tathāgata’s teachings.’ “

source: །ལྷ་མོ་དགེ་བའི་རྩ་བ་དེས་ན་ཁྱོད་གཏོགས་པ་བཞི་ངའི་བསྟན་པ་ལ་དཀའ་བ་མང་པོ་བྱེད་ཅིང་སྐྱེ་བོ་ཕལ་དང་འཐུན་པར་བྱེད་པ་ཡིན་ཏེ།
en: Goddess, because of being endowed with these virtuous roots, these four—including you—have undertaken many hardships for the sake of my teachings and acted in harmony with ordinary beings.

source: ལྷ་མོ་ཁྱེད་བཞི་ནི་ད་ལྟ་འབའ་ཞིག་ཀྱང་མ་ཡིན་གྱི། འདས་པའི་དུས་ན་ཡང་ང་ལ་རྣམ་པ་མང་པོར་བྱ་བ་བྱས་ཤིང་ངའི་བསྟན་པའི་ཁུར་གྱི་བཀོད་པ་ལ་སྨོན་ལམ་བཏབ་པ་ཡིན་གྱིས།
en: Goddess, not only in the present but also in the past, you four have performed activities in many forms and made vows to bear the arrayed burdens of my teachings.

source: ལྷ་མོ་སེམས་མངོན་པར་དད་པར་གྱིས་ལ་སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པར་ཤེས་པར་གྱིས་ཤིག །
en: Goddess, you should know that you have paid veneration to many buddhas with a mind of deep faith.”

source: དེ་ནས་ལྷ་མོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བདག་གི་བསམ་པ་དང་བར་འགྱུར་བ་དང་། སྐྱེ་བོ་མང་པོ་ལ་སྨན་པར་འགྱུར་བའི་སླད་དུ་བདག་ཅག་བཞི་གང་ལགས་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: At this point the goddess addressed the Bhagavān, saying, “I beseech the Bhagavān to explain how I have developed this mind of faith and how we four have come to act as medicine for many sentient beings.”

source: །ལྷ་མོ་ཁྱོད་ལེགས་ཀྱིས་ཁྱོད་གཏོགས་པ་བཞི་ལུང་བསྟན་པའི་ཆོ་གའི་རིམ་པ་ལྷ་མོ་ཁྱོད་ཀྱིས་ཉོན་ཅིག །
en: Goddess, listen well as I explain in turn the prophecies related to these four, including you.

source: ལྷ་མོ་ཁྱོད་གཏོགས་པ་བཞིའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ལ་ལྟོས།
en: Goddess, see the greatness of the virtuous qualities of these four, including you yourself.

source: བློན་པོ་ཆེན་པོ་དམ་པའི་ཆོས་ཀྱི་དཀྱིལ་འཁོར་གྱི་མཛོད་དེ་ནི་སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་ཡིན་པར་རིག་པར་བྱའོ།
en: You should understand that the great minister Storehouse of the Domain of the Sacred Dharma is the brahmin Kauṇḍinya, the master grammarian.
